app/views/teams/index.html.erb

        <td><%= team.description %></td>
        <td><%= team.tools.count %></td>
        <td><%= team.students.count %></td>
---
SELECT COUNT(*) FROM "tools" WHERE "tools"."team_id" = ?  [["team_id", 1]]
SELECT COUNT(*) FROM "students" WHERE "students"."team_id" = ?  [["team_id", "1"]]