app/views/tools/_form.html.erb

    <%#= form.number_field :team_id, id: :tool_team_id %>
    <%= form.select:team_id,Team.all.collect{|s|[s.name, s.id]} %>
---
SELECT "teams".* FROM "teams"