app/views/students/_form.html.erb

    <%#= form.text_field :team_id, id: :student_team_id %>
    <%= form.select:team_id,Team.all.collect{|s|[s.name, s.id]} %>
---
SELECT "teams".* FROM "teams"