app/controllers/students_controller.rb

INSERT INTO "students" ("given_name", "family_name", "email", "password", "password_confirmation", "team_id", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "password_digest" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["password_digest", "$2a$12$UO5q1Ytd.NIjoECwNdBwjeaE3zATgRS/0nEL5IMIvIriFV1J2nqCO"], ["updated_at", "2019-12-02 03:09:20.886025"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)