app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def index
    @tools = Tool.all

INSERT INTO "tools" ("name", "description", "quantity", "team_id", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Tijera"], ["description", "qwe"], ["quantity", 12], ["team_id", 2], ["photo", "zxc"], ["created_at", "2019-12-02 02:45:12.787988"], ["updated_at", "2019-12-02 02:45:12.787988"]]
---
  def create
    @tool = Tool.new(tool_params)

    respond_to do |format|
      if @tool.save

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tool
      @tool = Tool.find(params[:id])